AUTO_config_TK_pesok/src/DataProcessors/ВыгрузкаPlanohero/ВыгрузкаPlanohero.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаPlanohero</name>
  <attributes>
    <name>СоздаватьОбъекты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделения</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураНачало</name>
  </attributes>
  <attributes>
    <name>СтруктураДанных</name>
  </attributes>
  <tabularSections>
    <name>АктивныеСклады</name>
    <attributes>
      <name>Shop</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СкладыКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Активный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/InformationRegisters/РезультатыВыполненияОбработок/РезультатыВыполненияОбработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыВыполненияОбработок</name>
  <resources>
    <name>Успешный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СообщенияОбОшибках</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/DataProcessors/ВыгрузкаPlanohero/ManagerModule.bsl
Процедура ВыгрузитьДанные() Экспорт
	РезультатВыполненияОбработки = РегистрыСведений.РезультатыВыполненияОбработок;	
	СтруктураЗаписиРезультата = РезультатВыполненияОбработки.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиРезультата.ИдентификаторОбработки = "ВыгрузкаPlanohero Тест Задания";
	СтруктураЗаписиРезультата.КлючОбработки = "ВыгрузкаPlanohero Тест Задания";
	РезультатВыполненияОбработки.ДобавитьКомментарий("Тест Задания.Planohero", СтруктураЗаписиРезультата);
	РезультатВыполненияОбработки.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиРезультата,Истина);
КонецПроцедуры
